espruino/Espruino/libs/banglejs/banglejs3_py32/src/main.c
/*
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2026 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * LCD driver firmware for Bangle.js 3
 * ----------------------------------------------------------------------------
 */
#include "py32f07x_hal.h"
#include "main.h"
#include "swd.h"
#include "lcd.h"
#include "mini_rtt.h"

/* TODO:

Watchdog
Disable RTT (or make it switchable?)

*/

static void APP_SystemClockConfig(void);
static void APP_GPIO_Config(void);
static void APP_LCD_GPIO_Config(void);

// ----------------------------------------
EXTI_HandleTypeDef hexti_pa0;
EXTI_HandleTypeDef hexti_pa11;
EXTI_HandleTypeDef hexti_pa15;
ADC_HandleTypeDef hadc;
SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_rx;
DMA_HandleTypeDef hdma_spi1_tx;
RTC_HandleTypeDef hrtc;
// ----------------------------------------

#define LCD_ROWS_BUFFERED 16
#define LCD_ROW_BYTES 180 // 240 * 6 bit (in bytes)
#define LCD_ROW_STRIDE (LCD_ROW_BYTES+1) // 240 * 6 bit (in bytes)
#define SPI_BUFFER_LEN (LCD_ROW_STRIDE*(LCD_ROWS_BUFFERED*2)) // enough for display - 2x sets of lines (with first byte as command byte)
uint8_t spiBuffer[SPI_BUFFER_LEN];
volatile bool spiReady[2]; // is first or second part of the SPI buffer ready?

PY32State state;

void APP_ErrorHandler(void)
{
  int flash=11;
  while (--flash) { // flash torch on app error
    HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_8);
    HAL_Delay(50);
  }
   while (1);
}

void Fatal_Error(const char *msg) {
  lcd_clear();
  lcd_print("LCD ERROR\r\n");
  lcd_println((char*)msg);
  APP_ErrorHandler();
}


static void D() { /*for (volatile int i=0;i<0;i++);*/ }
static void DX() { for (volatile int i=0;i<100;i++); }

/// Reset the buffer contents for next SPI transaction
void SPI1_Reset_Buffer() {
  spiReady[0] = false;
  spiReady[1] = false;
  uint8_t *buf = spiBuffer;
  buf[0] = state.buttonMask | (state.input<<4);
  buf[1] = state.output&255;
  buf[2] = state.output>>8;

  // Totally reset SPI peripheral to clear out unsent bytes
  uint32_t oldCR1 = SPI1->CR1;
  __HAL_RCC_SPI1_FORCE_RESET();
  __HAL_RCC_SPI1_RELEASE_RESET();
  SPI1->CR1 |= oldCR1;
  // Queue up new data
  if (HAL_SPI_TransmitReceive_DMA(&hspi1, spiBuffer, spiBuffer, SPI_BUFFER_LEN) != HAL_OK) {
    Fatal_Error("SPI DMA restart");
  }
}

void flip_from_spi() {
  int spiIdx = 0; // 0 or 1 for first/second half

  volatile uint32_t *GPIOA_ODR = &GPIOA->ODR;
  volatile uint32_t *GPIOA_BSRR = &GPIOA->BSRR;
  volatile uint32_t *GPIOA_BRR = &GPIOA->BRR;

  LCD_XRST(0);DX();DX();DX();DX();DX();
  LCD_XRST(1);D();
  LCD_VCK(0);DX();
  LCD_VST(1);DX();
  LCD_VCK(1);DX();
  LCD_VST(0);DX();
  LCD_VCK(0);DX();
  LCD_VCK(1);DX();

  for (int blk=0;blk<(240/LCD_ROWS_BUFFERED);blk++) { // each block is one half of the SPI buffer
    uint8_t *buf = spiIdx ? &spiBuffer[SPI_BUFFER_LEN>>1] : spiBuffer;
    rtt_printf("->%d\n", spiIdx+1);
    // handle partial updates by skipping lines
    if (blk==0) {
      int yoffset = buf[0]&127;
      while (yoffset > 0) {
        // 2us delay - the timing of these is actually quite important as
        // too much delay means our buffer overruns before we get to transmit
        LCD_VCK(0);for (volatile int i=0;i<10;i++);
        LCD_VCK(1);for (volatile int i=0;i<10;i++);
        LCD_VCK(0);for (volatile int i=0;i<10;i++);
        LCD_VCK(1);for (volatile int i=0;i<10;i++);
        yoffset--;
      }
    }

#define LCD_FAST 1
#define NO_REORDER __asm__ __volatile__("" ::: "memory")

    LCD_ENB(1);DX(); // start writing to the display now

    for (int y=0;y<LCD_ROWS_BUFFERED;y++) {
      uint8_t *linePtr = &buf[1+y*LCD_ROW_STRIDE]; // 6bpp * 240px / 8bits (+1 command byte)
      uint8_t *px;
      uint32_t ODR;
      /*
        We have to do a line of pixels MSB, then LSB
          R1R2G1G2B1B2
        But our pixels come in order:
          RlRhGlGhBlBhRlRhGlGhBlBh...

        So, we have to shuffle pixels around:

          RlRhGlGhBlBhRlRhGlGhBlBh...
        & 0 1 0 1 0 1 0 0 0 0 0 0
        & 0 0 0 0 0 0 0 1 0 1 0 1

        MSB: (C&42>>1) | ((c&2688)>>6)
        LSB: C&21 | ((c&1344)>>5)

        *but* this is for 12 bits = 2 pixels, which aligns badly. We could do 24 bits:

        MSB: (C&172074>>1) | ((c&11012736)>>6)
        LSB: C&86037 | ((c&5506368)>>5)

        LCD_FAST uses direct register writes to improve transit speed. When doing this, we
        run the risk of clocking too fast, so we spread out our byte reads for the next 4 bytes
        between each set (of clock/ODR/etc)
      */
      LCD_HST(1);D();
      LCD_HCK(1);D();
      LCD_HST(0);D();
      // MSB
      px = linePtr;
      ODR = *GPIOA_ODR & 0xFFFFFF80; // AND out colour + HCK, HCK=0
      uint32_t d; // input pixel data
#if LCD_FAST
      d = *(px++); // (fast only) Cortex M0+ doesn't do unaligned access
      d |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
      d |= *(px++)<<16; // Cortex M0+ doesn't do unaligned access
#endif
      for (int x=0;x<240;x+=4) {
        #if LCD_FAST // FAST
        uint32_t c = ((d&172074)>>1) | ((d&11012736)>>6);
        *GPIOA_ODR = ODR | (c&63); NO_REORDER; // LCD_COL(...)
        c>>=12;
        d = *(px++); // Cortex M0+ doesn't do unaligned access
        *GPIOA_BSRR = (1<<6); NO_REORDER; // LCD_HCK(1);
        d |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
        *GPIOA_ODR = ODR | (1<<6) | c; NO_REORDER; // LCD_COL(...)
        d |= *(px++)<<16; // Cortex M0+ doesn't do unaligned access
        *GPIOA_BRR = (1<<6); NO_REORDER; // LCD_HCK(0);
        #else // SLOW
        uint32_t c = *(px++); // Cortex M0+ doesn't do unaligned access
        c |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
        c |= *(px++)<<16;
        c = ((c&172074)>>1) | ((c&11012736)>>6);
        LCD_COL(c); // already ANDs by 63
        LCD_HCK(1);
        LCD_COL(c>>12);
        LCD_HCK(0);
        #endif
      }
      D();
      LCD_VCK(0);D();
      LCD_HST(1);D();
      LCD_HCK(1);D();
      LCD_HST(0);D();
      // LSB
      px = linePtr;
      ODR = *GPIOA_ODR & 0xFFFFFF80; // AND out colour + HCK, HCK=0
#if LCD_FAST
      d = *(px++); // (fast only) Cortex M0+ doesn't do unaligned access
      d |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
      d |= *(px++)<<16; // Cortex M0+ doesn't do unaligned access
#endif
      for (int x=0;x<240;x+=4) {
        #if LCD_FAST // FAST
        uint32_t c = (d&86037) | ((d&5506368)>>5);
        *GPIOA_ODR = ODR | (c&63); NO_REORDER; // LCD_COL(...)
        c>>=12;
        d = *(px++); // Cortex M0+ doesn't do unaligned access
        *GPIOA_BSRR = (1<<6); NO_REORDER; // LCD_HCK(1);
        d |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
        *GPIOA_ODR = ODR | (1<<6) | c; NO_REORDER; // LCD_COL(...)
        d |= *(px++)<<16; // Cortex M0+ doesn't do unaligned access
        *GPIOA_BRR = (1<<6); NO_REORDER; // LCD_HCK(0);
        #else // SLOW
        uint32_t c = *(px++); // Cortex M0+ doesn't do unaligned access
        c |= *(px++)<<8; // Cortex M0+ doesn't do unaligned access
        c |= *(px++)<<16;
        c = (c&86037) | ((c&5506368)>>5);
        LCD_COL(c); // already ANDs by 63
        LCD_HCK(1);
        LCD_COL(c>>12);
        LCD_HCK(0);
        #endif
      }
      D();
      LCD_VCK(1);D();
    }
    // we've finished this block... wait until next block has finished writing
    spiReady[spiIdx] = false;
    spiIdx = spiIdx^1;
    // no data ready and SPI finished -> exit
    if (!spiReady[spiIdx] && !state.spiInProgress) {
      rtt_printf("End %d %d\n", spiReady[spiIdx], state.spiInProgress);
      LCD_ENB(0); // cancelled - exit.
      SPI1_Reset_Buffer();
      return;
    }
    // SPI is in progress - wait until buffer is full or time out
    int timeout = 1000000;
    while (!spiReady[spiIdx]) {
      if (--timeout <= 0) {
        rtt_printf("timeout\n");
        LCD_ENB(0); // flash LED to show we've had a timeout error
        SPI1_Reset_Buffer();
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, 1);
        HAL_Delay(50);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, 0);
        return;
      }
    }
  }
  // datasheet shows 488 clocks (so maybe clock a few more out?)
  LCD_ENB(0);
  SPI1_Reset_Buffer();
}


uint32_t Read_ADC_PB0(void)
{
  uint32_t raw_value = 0;
  // Start the ADC peripheral conversion
  HAL_ADC_Start(&hadc);

  // Poll until conversion completes (with a 10ms timeout window)
  if (HAL_ADC_PollForConversion(&hadc, 10) == HAL_OK)
  {
      // Fetch the converted 12-bit result from the data register
      raw_value = HAL_ADC_GetValue(&hadc);
  }

  // Stop conversion to save internal operational power
  HAL_ADC_Stop(&hadc);

  return raw_value;
}

void Write_IRQ(bool asserted) {
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, !asserted);
  state.irqAsserted = asserted;
}

void BTN_Callback() {
  state.buttonPressed = true;
}

void Update_Outputs() {
  PY32OutputState o = state.output;
  /*lcd_print("O ");
  lcd_print_hex(o);
  lcd_println("");*/
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, (o&PY32_OUT_LCD_BL)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, (o&PY32_OUT_TORCH_ON)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, 1/*(o&PY32_OUT_AUX_SWAP)?1:0*/);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, (o&PY32_OUT_AUX_POWER)?0:1); // inverted. PY32_OUT_AUX_POWER set will enable the output
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_13, (o&PY32_OUT_RGB_ON)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_14, (o&PY32_OUT_SPEAKER_ON)?1:0);
  HAL_GPIO_WritePin(GPIOF, GPIO_PIN_6, (o&PY32_OUT_VIBRATE_ON)?1:0);
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_15, (o&PY32_OUT_CHARGE_EN)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, (o&PY32_OUT_WIFI_ON)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, (o&PY32_OUT_WIFI_BOOTLOADER)?1:0);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, (o&PY32_OUT_TOUCH_RST)?1:0);
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, (o&PY32_OUT_HRM_AUX)?1:0);
}

void nrf_reboot() {
  // set up nRST pin
  GPIO_InitTypeDef  GPIO_InitStruct;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Pin = GPIO_PIN_12; // MOTO PWM
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  // toggle nrst
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, 0);
  HAL_Delay(10);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, 1);
}

/// Called when an SPI transaction has completed (or the buffer is full!)
void SPI1_HandlePacket(int bytes_received) {
  rtt_printf("handlePkt\n");
  uint8_t *buf = spiBuffer;
  uint8_t cmd = buf[0];
  if (cmd >= PY32_CMD_DISPLAY) {
    // status is not read during display writes
    state.displayInProgress = true;
  } else switch (cmd) {
    case PY32_CMD_NONE:
      Write_IRQ(false); // assume status is read
      break;
    case PY32_CMD_SET_OUTPUT:
      Write_IRQ(false); // assume status is read
      state.output = buf[1] | (buf[2]<<8);
      Update_Outputs();
      break;
  }
}

