espruino/Espruino/libs/banglejs/banglejs3_py32/src/main.c
/// SPI NSS state has changed
void SPI1_NSS_Callback() {
  bool nss_pin_state = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_15) == GPIO_PIN_SET;
  if (nss_pin_state) { // idle - so transaction is complete
    /* If we've sent exactly half an SPI buffer then HAL_SPI_TxRx*CpltCallback has
    already been called at this point. However we could use bytes_received to allow
    us to cope with what happens when only part of a buffer has been sent to allow
    us to do smaller updates. */
    state.spiInProgress = false;
    bool wasDisplayUpdate = state.displayInProgress;
    state.displayInProgress = false;
    //__HAL_DMA_GET_COUNTER(hspi1.hdmarx);//
    uint32_t bytes_left = hspi1.hdmarx->Instance->CNDTR;
    uint32_t bytes_received = SPI_BUFFER_LEN - bytes_left;
    // FIXME: use bytes_received to handle partial updates being sent to display
    rtt_printf("NSS %d\n", bytes_received);

    // restart SPI transaction for next packet
    HAL_SPI_DMAStop(&hspi1);
    if (!wasDisplayUpdate) {
      SPI1_HandlePacket(bytes_received);
      SPI1_Reset_Buffer();
    }

    SET_BIT(SPI1->CR1, SPI_CR1_SSI); // disable SPI
  } else { // transaction start
    CLEAR_BIT(SPI1->CR1, SPI_CR1_SSI); // enable SPI
    state.spiInProgress = true;
  }
}

void Set_State_Changed() {
  if (!state.spiInProgress) {
    HAL_SPI_DMAStop(&hspi1);
    SPI1_Reset_Buffer();
  }
  // FIXME: What if we're currently busy? How do we flag a new state change?
  Write_IRQ(true);
}

// Called when touchscreen state changes
void Touch_IRQ_Callback() {
  if (!state.initialised) return;
  bool irq_state = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_11) != GPIO_PIN_SET; // inverted

  if (irq_state) {
    state.input |= PY32_IN_TOUCH_IRQ;
    //lcd_println("TOUCH ON");
  } else {
    state.input &= ~PY32_IN_TOUCH_IRQ;
    //lcd_println("TOUCH OFF");
  }
  Set_State_Changed();
  // FIXME: update input state
}

// Called when the DMA finishes transferring the FIRST half of the buffer (index 0 to BUFFER_SIZE/2 - 1)
void HAL_SPI_TxRxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
  rtt_printf("1\n");
  // Safe to read/write the FIRST half of tx_buffer and rx_buffer
  // Process rx_buffer[0] through rx_buffer[(BUFFER_SIZE/2) - 1]
  if (hspi->Instance == SPI1) {
    if (!state.displayInProgress) // if we're displaying, main loop should handle this when spiWriteSecondHalf changed
      SPI1_HandlePacket(sizeof(spiBuffer[0]));
    spiReady[0] = true; // first half is ready
  }
}

// Called when the DMA finishes transferring the SECOND half of the buffer (index BUFFER_SIZE/2 to BUFFER_SIZE - 1)
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi) {
  rtt_printf("2\n");
  // Safe to read/write the SECOND half of tx_buffer and rx_buffer
  // Process rx_buffer[BUFFER_SIZE/2] through rx_buffer[BUFFER_SIZE - 1]
  if (hspi->Instance == SPI1) {
    spiReady[1] = true; // second half is ready now
  }
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
  rtt_printf("SPI ERR %d\n", hspi->ErrorCode);
  lcd_print_hex(hspi->ErrorCode);
  lcd_println(" SPI ERR");
  if (hspi->ErrorCode & HAL_SPI_ERROR_OVR) {
    __HAL_SPI_CLEAR_OVRFLAG(hspi);
    hspi->ErrorCode = HAL_SPI_ERROR_NONE;
    hspi->State     = HAL_SPI_STATE_READY;
    // re-enable
    SPI1_Reset_Buffer();
  }
}

void HAL_SPI_AbortCpltCallback(SPI_HandleTypeDef *hspi)
{
  lcd_println("SPI ABORT");
}

int main(void) {
  rtt_printf("LCD "LCD_VERSION"\n");
  HAL_Init();
  /* LCD GPIO Config */
  APP_LCD_GPIO_Config();
  lcd_init();
  lcd_println("LCD "LCD_VERSION"\r\n");

  state.initialised = false;
  state.output = PY32_OUT_DEFAULTS;

  /* System Clock Configuration */
  APP_SystemClockConfig();


  /* GPIO Initialization */
  APP_GPIO_Config();
  HAL_Delay(10);

  //swdInit();
  //swdReset();
  //swdKill();
  // or use PA12 NRF54 NRST for reset?

  lcd_println("BANGLE.JS 3 BOOTING...");

  // FIXME - look out for SPI commands coming in. If no command,
  // enter recovery mode using SWD commands.

  state.initialised = true;

  uint32_t lastVal = 0;
  uint16_t valStable = 0;
  while (1) {
    //HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_8);
    if (state.buttonPressed) {
      uint32_t val = Read_ADC_PB0();
      int diff = val-lastVal;
      if (diff<0) diff = -diff;
      lastVal = val;
      if (diff<10) {
        if(valStable<65535) valStable++;
      } else valStable=0;
      //rtt_printf("b%d %d %d\n",val, diff, valStable);
      if (valStable>200) { // wait until a stable reading
        int nearest = 0;
        if (val > 0x800) {
          state.buttonPressed = false;
          state.buttonLength = 0;
        } else { // search for nearest button state
          uint16_t buttonValues[16] = {
            0xFFFF,        0xC0,        0x196,        0x86,
            0x308,        0xA0,        0x11E,        0x76,
            0x55D,        0xB1,        0x154,        0x80,
            0x235,        0x95,        0xFA,        0x70 };
          int nearestDiff = 0xFFFF;
          for (int i=1;i<16;i++) {
            int diff = (val>buttonValues[i]) ? (val-buttonValues[i]) : (buttonValues[i]-val);
            if (diff<nearestDiff) {
              nearestDiff = diff;
              nearest = i;
            }
          }
        }
        if (state.buttonMask != nearest) { // button state changed - update IRQ flag
          state.buttonLength = 0;
          // FIXME: what about a button pressed so quick it changes before we can poll?
          rtt_printf("BTN %d\n",nearest);
          state.buttonMask = nearest;
          Set_State_Changed();
        } else {
          if (state.buttonLength < 65535)
            state.buttonLength++;
          // 4 button long-press reboot
          if (state.buttonLength==PY32_4BTN_REBOOT_DELAY && state.buttonMask==15) {
            rtt_printf("nRF reboot\n");
            nrf_reboot();
          }
        }
      }
    }
    if (state.displayInProgress) {
      flip_from_spi();
    } else if (!state.spiInProgress && !state.buttonPressed && !state.irqAsserted) {
      // don't suspend if IRQ is asserted since we'll be woken up very soon anyway
      HAL_SuspendTick();
      HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_SLEEPENTRY_WFI); // actually sleep
      HAL_ResumeTick();
    }
  }
}

